# NICKs condensed notebook

In [1]:
import pandas as pd
import numpy as np
import csv
import matplotlib.pyplot as plt
import sqlite3
%matplotlib inline

In [2]:
#extract IMDB movie basics table from SQL database

In [3]:
!cd

In [4]:
conn = sqlite3.connect('')

OperationalError: unable to open database file

In [5]:
movie_basics_df = pd.read_sql("""
SELECT * 
FROM movie_basics
""",conn )

NameError: name 'conn' is not defined

In [6]:
movie_basics_df.head(2)

NameError: name 'movie_basics_df' is not defined

In [25]:
movie_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [ ]:
#extract csvs to dataframes. bom, tn, tmdb

In [75]:
bom_raw_df = pd.read_csv('bom.movie_gross.csv')
bom_raw_df.head(2)

                        title studio  domestic_gross  foreign_gross  year
0                 Toy Story 3     BV     415000000.0    652000000.0  2010
1  Alice in Wonderland (2010)     BV     334200000.0    691300000.0  2010

In [31]:
tn_raw_df = pd.read_csv('tn.movie_budgets.csv')
tn_raw_df.head(2)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"

In [ ]:
#Create clean title columns for matching 1) MOVIE_BASICS

In [32]:
movie_basics_df['clean_title'] = movie_basics_df['primary_title'].str.lower()

In [34]:
movie_basics_df['clean_title'] = movie_basics_df['clean_title'].str.replace("'","").replace(',', '').replace(':','').replace('.','').replace('-','')

In [35]:
#move clean title to the front then rest index
movie_basics_df.set_index('clean_title', inplace = True)

In [37]:
movie_basics_df.reset_index(inplace = True)
movie_basics_df.head(2)

,index,clean_title,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,0,sunghursh,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,1,one day before the rainy season,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"

In [ ]:
#2) BOM RAW

In [76]:
bom_raw_df['clean_title'] = bom_raw_df['title'].str.lower()

In [77]:
bom_raw_df['clean_title'] = bom_raw_df['clean_title'].str.replace("'","").replace(',', '').replace(':','').replace('.','').replace('-','')

In [80]:
bom_raw_df.set_index('clean_title', inplace = True)
bom_raw_df.head(2)

,title,studio,domestic_gross,foreign_gross,year
clean_title,,,,,
toy story 3,Toy Story 3,BV,415000000.0,652000000.0,2010
alice in wonderland (2010),Alice in Wonderland (2010),BV,334200000.0,691300000.0,2010

In [47]:
#tn_budgets

In [50]:
tn_raw_df['clean_title'] = tn_raw_df['movie'].str.lower()

In [63]:
for title in tn_raw_df['clean_title']: 
    title.replace("'","").replace(',', '').replace(':','').replace('.','').replace('-','')

In [64]:

tn_raw_df.reset_index( inplace = True)
tn_raw_df.head(2)

,level_0,index,clean_title,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,0,0,avatar,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,1,1,pirates of the caribbean: on stranger tides,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"

In [61]:
bom_raw_df

,title,studio,domestic_gross,foreign_gross,year
clean_title,,,,,
toy story 3,Toy Story 3,BV,415000000.0,652000000.0,2010
alice in wonderland (2010),Alice in Wonderland (2010),BV,334200000.0,691300000.0,2010
harry potter and the deathly hallows part 1,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000.0,2010
inception,Inception,WB,292600000.0,535700000.0,2010
shrek forever after,Shrek Forever After,P/DW,238700000.0,513900000.0,2010
...,...,...,...,...,...
the quake,The Quake,Magn.,6200.0,NaN,2018
edward ii (2018 re-release),Edward II (2018 re-release),FM,4800.0,NaN,2018
el pacto,El Pacto,Sony,2500.0,NaN,2018
the swan,The Swan,Synergetic,2400.0,NaN,2018
an actor prepares,An Actor Prepares,Grav.,1700.0,NaN,2018

In [65]:
#CLEAN title not eliminating punctuation rn so going to do it in excel
tn_raw_df.to_csv('tn_raw_clean_fix.csv')
#checking the others
bom_raw_df.to_csv('bom_raw_clean_fix.csv')
movie_basics_df.to_csv('movie_basics_clean_fix.csv')

In [ ]:
#that didn't work for the movie_basics because the file is too large so

In [ ]:
#engineer a foreign_gross for tn and worldwide_gross for bom

In [81]:
bom_raw_df['worldwide_gross'] = bom_raw_df['foreign_gross'] + bom_raw_df['domestic_gross']

In [72]:
#having trouble fixing number formats so
tn_raw_df.to_csv('tn_numfix.csv')

In [73]:
tn_fixed_df = pd.read_csv('tn_numfix.csv')
tn_fixed_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         5782 non-null   int64
 1   level_0            5782 non-null   int64
 2   index              5782 non-null   int64
 3   clean_title        5782 non-null   object
 4   id                 5782 non-null   int64
 5   release_date       5782 non-null   object
 6   movie              5782 non-null   object
 7   production_budget  5782 non-null   int64
 8   domestic_gross     5782 non-null   int64
 9   worldwide_gross    5782 non-null   int64
dtypes: int64(7), object(3)
memory usage: 451.8+ KB

In [82]:
#now to engineer foreign gross
tn_raw_df['foreign_gross'] = tn_raw_df['worldwide_gross'] + tn_raw_df['domestic_gross']

# NOW TO JOIN THEM

In [87]:

tn_raw_df.drop(['level_0', 'index'], axis = 1, inplace =True)

In [88]:
tn_raw_df.set_index('clean_title', inplace=True)

In [89]:

tn_mbasics_merge = movie_basics_df.join(tn_raw_df, on='clean_title')
tn_mbasics_merge.head(2)

,index,clean_title,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,foreign_gross
0,0,sunghursh,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1,one day before the rainy season,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [93]:
tn_mbasics_merge.drop('index', axis=1, inplace=True)

In [90]:
#check the merge info
tn_mbasics_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 146353 entries, 0 to 146143
Data columns (total 15 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   index              146353 non-null  int64
 1   clean_title        146353 non-null  object
 2   movie_id           146353 non-null  object
 3   primary_title      146353 non-null  object
 4   original_title     146332 non-null  object
 5   start_year         146353 non-null  int64
 6   runtime_minutes    114581 non-null  float64
 7   genres             140940 non-null  object
 8   id                 3897 non-null    float64
 9   release_date       3897 non-null    object
 10  movie              3897 non-null    object
 11  production_budget  3897 non-null    object
 12  domestic_gross     3897 non-null    object
 13  worldwide_gross    3897 non-null    object
 14  foreign_gross      3897 non-null    object
dtypes: float64(2), int64(2), object(11)
memory usage: 17.9+ MB

In [96]:
#lets try merging this with bom before dropping nulls
all_merged_df = tn_mbasics_merge.join(bom_raw_df, on='clean_title', rsuffix = 'bom')

In [97]:
all_merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 146355 entries, 0 to 146143
Data columns (total 20 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   clean_title         146355 non-null  object
 1   movie_id            146355 non-null  object
 2   primary_title       146355 non-null  object
 3   original_title      146334 non-null  object
 4   start_year          146355 non-null  int64
 5   runtime_minutes     114583 non-null  float64
 6   genres              140942 non-null  object
 7   id                  3897 non-null    float64
 8   release_date        3897 non-null    object
 9   movie               3897 non-null    object
 10  production_budget   3897 non-null    object
 11  domestic_gross      3897 non-null    object
 12  worldwide_gross     3897 non-null    object
 13  foreign_gross       3897 non-null    object
 14  title               3515 non-null    object
 15  studio              3512 non-null    object
 16  domestic_grossbom   3490 non-null    float64
 17  foreign_grossbom    2130 non-null    float64
 18  year                3515 non-null    float64
 19  worldwide_grossbom  2105 non-null    float64
dtypes: float64(6), int64(1), object(13)
memory usage: 23.4+ MB

In [101]:
#now to drop NAs
all_merged_df.dropna(subset = ['release_date'], inplace =True)

In [102]:
all_merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3897 entries, 20 to 146078
Data columns (total 20 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   clean_title         3897 non-null   object
 1   movie_id            3897 non-null   object
 2   primary_title       3897 non-null   object
 3   original_title      3896 non-null   object
 4   start_year          3897 non-null   int64
 5   runtime_minutes     3401 non-null   float64
 6   genres              3824 non-null   object
 7   id                  3897 non-null   float64
 8   release_date        3897 non-null   object
 9   movie               3897 non-null   object
 10  production_budget   3897 non-null   object
 11  domestic_gross      3897 non-null   object
 12  worldwide_gross     3897 non-null   object
 13  foreign_gross       3897 non-null   object
 14  title               1666 non-null   object
 15  studio              1666 non-null   object
 16  domestic_grossbom   1665 non-null   float64
 17  foreign_grossbom    1426 non-null   float64
 18  year                1666 non-null   float64
 19  worldwide_grossbom  1425 non-null   float64
dtypes: float64(6), int64(1), object(13)
memory usage: 639.4+ KB

In [105]:
all_merged_df['foreign_gross']

20                      $73,706$0
33        $122,133,227$70,433,227
40           $1,165,996$1,109,808
48             $9,313,302$720,828
54        $187,861,183$58,236,838
                   ...
145843       $6,916,869$6,916,869
145937      $10,551,417$8,224,288
145986                       $0$0
146025       $1,110,511$1,017,107
146078    $165,720,921$81,562,942
Name: foreign_gross, Length: 3897, dtype: object

In [106]:
#looks like we need to take a closer look in excel and fix numbers
all_merged_df.to_csv('all_merged_fixup.csv')

In [107]:
final_merge_df = pd.read_csv('all_merged_fixup.csv')

In [108]:
final_merge_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3897 entries, 0 to 3896
Data columns (total 21 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          3897 non-null   int64
 1   clean_title         3897 non-null   object
 2   movie_id            3897 non-null   object
 3   primary_title       3897 non-null   object
 4   original_title      3896 non-null   object
 5   start_year          3897 non-null   int64
 6   runtime_minutes     3401 non-null   float64
 7   genres              3824 non-null   object
 8   id                  3897 non-null   int64
 9   release_date        3897 non-null   object
 10  movie               3897 non-null   object
 11  production_budget   3897 non-null   int64
 12  domestic_gross      3897 non-null   int64
 13  worldwide_gross     3897 non-null   int64
 14  foreign_gross       3897 non-null   int64
 15  title               1666 non-null   object
 16  studio              1666 non-null   object
 17  domestic_grossbom   1665 non-null   float64
 18  foreign_grossbom    1426 non-null   float64
 19  year                1666 non-null   float64
 20  worldwide_grossbom  1425 non-null   float64
dtypes: float64(5), int64(7), object(9)
memory usage: 639.5+ KB

In [109]:
#Great now lets lets look at genres
genres_imdb_list= set(list([x for x in final_merge_df['genres']]))

In [110]:
genres_imdb_list = list(genres_imdb_list)
genres_working1 = []
for x in genres_imdb_list:
       genres_working1.append(str(x))

In [112]:
genres_working2 = []
for x in genres_working1:
    for y in x.split(sep =','):
        genres_working2.append(y)
imdb_genres = list(set(genres_working2))
imdb_genres.pop(1)
imdb_genres.pop(-9)
imdb_genres

['Sport',
 'Crime',
 'News',
 'Romance',
 'Sci-Fi',
 'Western',
 'Horror',
 'Drama',
 'Family',
 'nan',
 'Mystery',
 'Musical',
 'Fantasy',
 'Adventure',
 'Documentary',
 'Thriller',
 'Comedy',
 'Reality-TV',
 'Music',
 'History',
 'Action',
 'Animation']

In [ ]:
#NOW TO BUILD BOOLEAN GENRE COLUMNS

In [113]:
for x in imdb_genres:
    final_merge_df[x] = (final_merge_df['genres'].str.contains(x))

In [114]:
final_merge_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3897 entries, 0 to 3896
Data columns (total 43 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          3897 non-null   int64
 1   clean_title         3897 non-null   object
 2   movie_id            3897 non-null   object
 3   primary_title       3897 non-null   object
 4   original_title      3896 non-null   object
 5   start_year          3897 non-null   int64
 6   runtime_minutes     3401 non-null   float64
 7   genres              3824 non-null   object
 8   id                  3897 non-null   int64
 9   release_date        3897 non-null   object
 10  movie               3897 non-null   object
 11  production_budget   3897 non-null   int64
 12  domestic_gross      3897 non-null   int64
 13  worldwide_gross     3897 non-null   int64
 14  foreign_gross       3897 non-null   int64
 15  title               1666 non-null   object
 16  studio              1666 non-null   object
 17  domestic_grossbom   1665 non-null   float64
 18  foreign_grossbom    1426 non-null   float64
 19  year                1666 non-null   float64
 20  worldwide_grossbom  1425 non-null   float64
 21  Sport               3824 non-null   object
 22  Crime               3824 non-null   object
 23  News                3824 non-null   object
 24  Romance             3824 non-null   object
 25  Sci-Fi              3824 non-null   object
 26  Western             3824 non-null   object
 27  Horror              3824 non-null   object
 28  Drama               3824 non-null   object
 29  Family              3824 non-null   object
 30  nan                 3824 non-null   object
 31  Mystery             3824 non-null   object
 32  Musical             3824 non-null   object
 33  Fantasy             3824 non-null   object
 34  Adventure           3824 non-null   object
 35  Documentary         3824 non-null   object
 36  Thriller            3824 non-null   object
 37  Comedy              3824 non-null   object
 38  Reality-TV          3824 non-null   object
 39  Music               3824 non-null   object
 40  History             3824 non-null   object
 41  Action              3824 non-null   object
 42  Animation           3824 non-null   object
dtypes: float64(5), int64(7), object(31)
memory usage: 1.3+ MB

In [115]:
#OK all set lets save this down
final_merge_df.to_csv('final_data_nk.csv')